app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
{
    return User::create([
        'department' => $data['department'],
        'faculty' => $data['faculty'],
        'email' => $data['email'],
        'password' => Hash::make($data['password']),
    ]);
---
insert into `users` (`department`, `faculty`, `email`, `password`, `updated_at`, `created_at`) values ('social science', 'arts', 'thisoliversamuels@gmail.com', '$2y$10$/vtSCiyhQ.S0qwuWjYRGauBndQoyUCHM3VfKIoFV.SzLzagtTz0Lm', '2023-11-15 00:06:51', '2023-11-15 00:06:51')