app/Http/Controllers/CourseController.php

select * from `courses` where `user_id` = 1
---
    public function index()
{
    $user = auth()->user(); // Get the authenticated user
    $courses = Course::where('user_id', $user->id)->get(); // Filter courses based on user ID

select * from `courses`
---
   public function create()
{
    $courses = Course::all();

delete from `courses` where `id` = 4
---
    public function destroy(Course $course)
    {
        $course->delete();