app/Http/Controllers/CourseController.php

    public function store(Request $request)
{
    $request->validate([
        'name' => 'required',
        'code' => 'required|unique:courses',
        'credit_hours' => 'nullable|numeric',
        'lecturers' => ['required', 'array'], // Updated validation rule for lecturers
    ]);

    // Convert the lecturers array to JSON before storing
    $request->merge(['lecturers' => json_encode($request->input('lecturers'))]);

    Course::create($request->all());
---
insert into `courses` (`name`, `code`, `credit_hours`, `lecturers`, `updated_at`, `created_at`) values ('Rahman Godarzi', 'f1a65d2159', '', '[\"\"]', '2023-11-14 22:53:48', '2023-11-14 22:53:48')