app/Http/Controllers/LecturerController.php

    public function index()
    {

        $user = auth()->user(); // Get the authenticated user
        $lecturers = Lecturer::where('user_id', $user->id)->get(); // Filter Lecturers based on user ID
        $lecturers = Lecturer::all();
---
select * from `lecturers` where `user_id` = 2
select * from `lecturers`

    public function store(Request $request)
{
    $request->validate([
        'name' => 'required',
        'email' => 'nullable|email',
    ]);

    $user = Auth::user(); // Get the authenticated user
    $lecturerData = $request->all(); // Get all lecturer data
    $lecturerData['user_id'] = $user->id; // Add user ID to lecturer data

    Lecturer::create($lecturerData); // Create new lecturer record in the database
---
insert into `lecturers` (`name`, `email`, `user_id`, `updated_at`, `created_at`) values ('.htaccess', 'admin@gmail.com', 2, '2023-11-15 00:42:09', '2023-11-15 00:42:09')